
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.ПолноеИмяФайла = ИмяФайла;
	
	Если Диалог.Выбрать() Тогда
		ВыбранныйФайл = Новый Файл(Диалог.ПолноеИмяФайла);
		Если ВыбранныйФайл.Размер()/1024/1024 > МаксимальныйРазмерФайла Тогда
			Сообщить("Выбранный файл превышает максимальный размер");
			Возврат;
		КонецЕсли;
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Комментарий = Параметры.Комментарий;
	МаксимальныйРазмерФайла = Параметры.МаксимальныйРазмерФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Комментарий", Комментарий);
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		СтруктураВозврата.Вставить("ФайлИмя", ИмяФайла);
	КонецЕсли;
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры
