
Функция ПечатьАктаОбОказанииУслуг(ДокументСсылка) Экспорт
	
	Перем ПараметрыПечати;
	Перем ОбъектыПечати;
	Перем ПараметрыВывода;
	Перем ТабДокумент;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ДокументСсылка);
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("Акт");
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	Документы.РеализацияТоваровУслуг.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	ТабДокумент = КоллекцияПечатныхФорм[0].ТабличныйДокумент; 

	Возврат ТабДокумент;

КонецФункции // ПечатьАктаОбОказанииУслуг()

Функция ПечатьСФ(ДокументСсылка) Экспорт
	
	Перем ПараметрыПечати;
	Перем ОбъектыПечати;
	Перем ПараметрыВывода;
	Перем ТабДокумент;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ДокументСсылка);
	
	НастройкиПечати = УчетНДСВызовСервера.ПолучитьНастройкиПечатиСчетовФактур(МассивОбъектов);
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(НастройкиПечати.СписокМакетов);
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();

	Документы.СчетФактураВыданный.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	ТабДокумент = КоллекцияПечатныхФорм[0].ТабличныйДокумент; 

	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой заказа или счета,
// разработанного методистами
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьСчетаЗаказа(ДокументСсылка, Тип = "Счет") Экспорт
	
	Перем ПараметрыПечати;
	Перем ОбъектыПечати;
	Перем ПараметрыВывода;
	Перем ТабДокумент;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ДокументСсылка);
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("СчетЗаказ");

	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();

	Документы.СчетНаОплатуПокупателю.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	ТабДокумент = КоллекцияПечатныхФорм[0].ТабличныйДокумент; 

	Возврат ТабДокумент;

КонецФункции // ПечатьСчетаЗаказа()

Функция ПечатьЗаявкиЭкспедирования(ДокументСсылка) Экспорт
	
	Перем ПараметрыПечати;
	Перем ОбъектыПечати;
	Перем ПараметрыВывода;
	Перем ТабДокумент;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ДокументСсылка);
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ЗаявкаНаПеревозку");
	
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	
	Документы.новаЗаявкаЭкспедирования.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	ТабДокумент = КоллекцияПечатныхФорм[0].ТабличныйДокумент; 

	Возврат ТабДокумент;

КонецФункции // ПечатьЗаявкиЭкспедирования()
