
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Наименование = Параметры.Наименование;
	Период = Параметры.Период;
	Комментарий = Параметры.Комментарий;
	КодРегиона = Параметры.КодРегиона;
	КодИФНС = Параметры.КодИФНС;
	ОГРН = Параметры.ОГРН;
	
	Если НЕ ПустаяСтрока(Параметры.РеквизитыСертификата) Тогда
		РеквизитыСертификата = ЗначениеИзСтрокиВнутр(Параметры.РеквизитыСертификата);
		
		Если ТипЗнч(РеквизитыСертификата) = Тип("Соответствие") Тогда
			
			ИНН = РеквизитыСертификата.Получить("INN");
			
			СНИЛС = РеквизитыСертификата.Получить("SNILS");
			Если НЕ ПустаяСтрока(СНИЛС) Тогда
				СНИЛС = Формат(Число(СНИЛС)/100, "ЧЦ=11; ЧДЦ=2; ЧРД=-; ЧРГ=-; ЧВН=");
			КонецЕсли;
			
			Если ПустаяСтрока(ОГРН) Тогда
				ОГРН = РеквизитыСертификата.Получить("OGRN");
			КонецЕсли;
			Адрес = РеквизитыСертификата.Получить("street");

			Если НЕ ПустаяСтрока(ОГРН) И ПустаяСтрока(КодИФНС) Тогда
				
				Модифицированность = Истина;
				
				КодРегиона = Сред(ОГРН, 4, 2);
				КодИФНС = КодРегиона + Сред(ОГРН, 6, 2);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Заголовок = "Сертификат "+Параметры.Отпечаток;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если НЕ ПустаяСтрока(ОГРН) И (ПустаяСтрока(КодИФНС) ИЛИ ПустаяСтрока(КодРегиона)) Тогда
		
		Модифицированность = Истина;
		
		КодРегиона = Сред(ОГРН, 4, 2);
		КодИФНС = КодРегиона + Сред(ОГРН, 6, 2);
		
	КонецЕсли;
	
	Если Модифицированность Тогда
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("Comment", Комментарий);
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("ifns", КодИФНС);
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("region_code", КодРегиона);
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить("ogrn", ОГРН);
	КонецЕсли;
	
КонецПроцедуры
